<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<link rel="stylesheet" href="css/style.min.css">
	<meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1">
	<title>Matheus Gon&ccedil;alves da Silva</title>
	<script>
  		(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  		(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  		m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  		})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		ga('create', 'UA-88771778-1', 'auto');
  		ga('send', 'pageview');
	</script>
</head>
<body>
	<div class="wrapper">
		<header>
			<div class="lang-icons">
				<a href="index.html"><img src="images/usa-flag-24.png" alt=""></a>
				<a href="pt-br.html"><img src="images/brazil-flag-24.png" alt=""></a>
			</div>
			<h1>Matheus Gon&ccedil;alves da Silva</h1>
			<div class="header-icons">
				<a href="https://github.com/PlayMa256/"><img src="images/github.png" /></a>
				<a href="https://br.linkedin.com/in/matheusgsilva"><img src="images/linkedin.png" /></a>
			</div>			
		</header>
		<section class="content-wrapper">
			<div class="centered-content">
				<section>
					<h2 class="section-title">Sobre</h2>
					<section class="content">
						<p>Estudante de bacharelado em sistemas de informa&ccedil;&atilde;o na UNICAMP (Campinas, S&atilde;o Paulo, Brasil), sou um amante de desenvolvimento web e estou sempre buscando aprender as novas tecnologias e ver quais s&atilde;o seus pontos fortes e fracos, assim consigo entender para qual cen&aacute;rio ela se encaixa melhor,
						desta maneira eu estarei &quot;sempre&quot; preparado para novos problemas.</p>
						<p>Estou come&ccedil;ando a contribuir ativamente para repositorios e projetos open-source em javascript e PHP. Sou ativo no canal de slack do laravel (larachat) e tamb&eacute;m no stackoverflow ajudando outros com suas perguntas e problemas.</p>
						<p>Meu foco principal, quando codificando, &eacute; criar um c&oacute;digo que seja facilmente lido por humanos e funcional sem comprometer a sua performance.</p>
					</section>
				</section>
				<section>
					<h2 class="section-title">Contato</h2>
					<section class="content">
						<a href="mailto: matheus.g.silva@hotmail.com">matheus.g.silva@hotmail.com</a>		
					</section>
				</section>
				<section>
					<h2 class="section-title">Educa&ccedil;&atilde;o</h2>
					<section class="content">
						<ul>
							<li>Graduando em Bacharelado em Sistemas de Informa&ccedil;&atilde;o - Unicamp</li>
							<li>
								<span>Alura</span>
								<ul>
									<li>Android: Aplica&ccedil;&otilde;es e armazenamento de dados - Parte 1, 2 e 3 - 28 horas</li>
									<li>Node.js: Inovando com Javascript no backend - 16 horas</li>
									<li>JavaScript avan&ccedil;ado I e II:  ES6, orienta&ccedil;&atilde;o a objetos e padr&otilde;es de projetos - 24 horas</li>
									<li>Meteor: Crie single page applications com JavaScript - 8 horas</li>
									<li>AngularJS: crie webapps poderosas - 16 horas</li>
									<li>MEAN Stack: Web moderna  - 16 horas</li>
									<li>Introdu&ccedil;&atilde;o a Laravel - 12 horas</li>
									<li>Laravel II: Mais t&eacute;cnicas e webapss poderosas - 12 horas</li>
									<li>Ruby on Rails 3 parte I, II e III - 48 horas</li>
									<li>Wordpress: Cria&ccedil;&atilde;o de um tema do zero - 8 horas</li>
									<li>Servlet 3 e Fundamentos Web - 16 horas</li>
									<li>Desenvolvimento Java Web com VRaptor 4 - 18 horas</li>
									<li>Spring MVC: &Eacute; hora de criar uma webapp com Spring MVC4 - 16 horas</li>
									<li>Web Services REST com JAX-RS e Jersey - 12 horas</li>
									<li>ASP.NET MVC 5: O framework pronto para a web - 20 horas</li>
								</ul>
							</li>
							<li>C# From Scratch - Pluralsight</li>
						</ul>
					</section>
				</section>
				<section>
					<h2 class="section-title">Idiomas</h2>
					<section class="content">
						<ul>
							<li>Ingl&ecirc;s - Avan&ccedil;ado</li>
							<li>Portugu&ecirc;s - Nativo</li>
							<li>Franc&ecirc;s - Iniciante</li>
						</ul>
					</section>
				</section>
				<section>
					<h2 class="section-title">Habilidades</h2>
					<section class="content">
						<ul>
							<li>
								<span>PHP</span>
								<ul>
									<li>Laravel</li>
									<li>Composer</li>
								</ul>
							</li>
							<li>HTML</li>
							<li>CSS - SCSS</li>
							<li>
								<span>Javascript</span>
								<ul>
									<li>MeteorJS</li>
									<li>
										<span>NodeJS</span>
										<ul>
											<li>NPM</li>
											<li>Bower</li>
										</ul>
									</li>
									<li>ES6</li>
									<li>React (Learning)</li>
								</ul>
							</li>
							<li>
								<span>Java</span>
								<ul>
									<li>Servlets</li>
									<li>Vraptor4</li>
									<li>SpringMVC</li>
								</ul>
							</li>
							<li>Linux</li>
							<li>Github</li>
							<li>Gulp - Elixir</li>
							<li>C - C++ - C#</li>
							<li>UML</li>
							<li>Design Patterns</li>
						</ul>
					</section>
				</section>
				<section>
					<h2 class="section-title">Projetos</h2>
					<section class="content">
						<h3 class="content-title">Sistema de reuni&otilde;es</h3>
						<p>	Desenvolvimento de um sistema para controlar a presen&ccedil;a de membros em reuni&otilde;es mensais, entre outras funcionalidades relacionadas. Havia a possibilidade de fazer um check-in atrav&eacute;s de um c&oacute;digo de barras presente em seu crach&aacute;.</p>
						<p>Foi desenvolvido usando PHP, Mysql e Jquery.</p>
					</section>
					<section class="content">
						<h3 class="content-title">Desenvolvimento de ERP</h3>
						<p>Desenvolvimento de um ERP para uma empresa familiar, com o objetivo de controlar todas a vendas realizadas. Atualmente est&aacute; em reformula&ccedil;&atilde;o para se adequar aos novos requisitos do neg&oacute;cio como: controle de estoque, controle de pedidos, reduzindo custos administrativos.</p>
						<p>Ele ir&aacute; ajudar a calcular: lucro, ERBITDA, dentre outros indicadores financeiros.</p>
						<p>A sua primeira vers&atilde;o foi desenvolvida em PHP, para possibilitar a visualiza&ccedil;&atilde;o de a&ccedil;&otilde;es em tempo real, est&aacute; sendo reformulado para NodeJS, using Sequelize.js como ORM.</p>
					</section>
					<section class="content">
						<h3 class="content-title">IV Tecnologia em foco - Website institucional - UNICAMP</h3>
						<p>
							Desenvolvido em wordpress, seu objetivo principal era exibir a programa&ccedil;&atilde;o das palestras, assim os estudantes poderiam se planejar e se registrar para as palestrar, tamb&eacute;m teve como objetivo armazenar todas as fotos tiradas durante a feira. Projeto desenvolvido em parceria com Andr&eacute; Matulionis dos Santos. Voc&ecirc; pode verificar o site <a href="http://www.ft.unicamp.br/IVtecnologiaemfoco/">Aqui</a>.
						</p>
					</section>
					<section class="content">
						<h3 class="content-title">Convers&atilde;o da ferramenta CourseViewer para o ambiente web.</h3>
						<p>Este projeto est&aacute; sendo feito para o TCC  com o objetivo de converter a atual vers&atilde;o do CourseViewer (Java Desktop) para o ambiente web, assim atingiria um p&uacute;blico maior, j&aacute; que a atual vers&atilde;o necessida da instala&ccedil;&atilde;o de java (JVM).</p>
						<p>O CourseViewer &eacute; uma ferramenta que ajuda coordenadores, estudantes e professores a entender a estrutura dos cursos, todo o curso, disponibilizando informa&ccedil;&otilde;es de forma clara e centralizada. Se o usuario precisar encontrar toda a informa&ccedil;&atilde;o necess&aacute;ria, ele/ela ter&aacute; que acessar diversas p&aacute;ginas no site da faculdade, ter diversas abas abertas em seu navegador o que tr&aacute;s v&aacute;rios inconvenientes. O entendimento errado de uma informa&ccedil;&atilde;o pode causar problemas graves a sua vida academica.</p>
						<p>Est&aacute; sendo desenvolvido em parceria com Andr&eacute; Matulionis dos Santos, que est&aacute; respons&aacute;vel pelo front-end da aplica&ccedil;&atilde;o.</p>
						<p>Eu, por outro lado, estou respons&aacute;vel por criar todos os endpoints rest, estruturar as tabelas do banco de dados, realizar todas as consultas e prover todo o conte&uacute;do necess&aacute;rio que a interface gr&aacute;fica requisitar.</p>
						<p>Este projeto prev&ecirc; a coopera&ccedil;&atilde;o de mais pesssoas no futuro, por isso o objetivo principal &eacute; ter um app com c&oacute;digo bem feito e claro, estrutura de arquivos clara/simples e f&aacute;cil de manter, diferente da vers&atilde;o desktop onde isso n&atilde;o ocorria. Eu tamb&eacute;m criei guias e politicas de contribui&ccedil;&atilde;o, desta maneira o c&oacute;digo estar&aacute; sempre limpo e organizado.</p>
						<p>Est&aacute; sendo desenvolvido com Laravel (utilizando passport e alguns outros pacotes), PostgreSQL e D3 para possibilitar o desenho dos nodes.</p>
					</section>
				</section>
			</div>
		</section>
	</div>
</body>
</html>
